Repository: DavidS/pdk
Catalog: locales/*/pdk.po
Languages: de

source: If you have a Puppet Forge username, add it here.
de: Was ist dein Puppet Forge Benutzername?

source: We can use this to upload your module to the Forge when it's complete.
de: Der Benutzername kann später verwendet werden um dein Modul auf der Puppet forge zu veröffentlichen.

source: Forge usernames can only contain lowercase letters and numbers
de: Forge-Benutzernamen dürfen nur Kleinbuchstaben und Ziffern enthalten

source: What version is this module?
de: Was ist die aktuelle Version dieses Moduls?

source: Puppet uses Semantic Versioning (semver.org) to version modules.
de: Puppet verwendet Semantic Versioning (http://semver.org) für Module.

source: Semantic Version numbers must be in the form MAJOR.MINOR.PATCH
de: Semantische Versionsnummern müssen der Form MAJOR.MINOR.PATCH entsprechen

source: Who wrote this module?
de: Wer ist der Autor dieses Moduls?

source: This is used to credit the module's author.
de: Dies wird zusammen mit dem Modul veröffentlicht.

source: What license does this module code fall under?
de: Unter welcher Lizenz ist das Modul erhältlich?

source: This should be an identifier from https://spdx.org/licenses/. Common values are "Apache-2.0", "MIT", or "proprietary".
de: Erlaubte Werte sind 'identifier' von https://spdx.org/licenses/. Übliche Lizenzen sind 'Apache-2.0', 'MIT', oder 'proprietary'.

source: What operating systems does this module support?
de: Welche Betriebssystem unterstützt dieses Modul?

source: Use the up and down keys to move between the choices, space to select and enter to continue.
de: Verwende die Pfeiltasten um zwischen den Optionen zu wählen, Leertaste zur Zuswahl und Enter um weiterzumachen.

source: Summarize the purpose of this module in a single sentence.
de: Beschreibe das Modul in einem Satz.

source: This helps other Puppet users understand what the module does.
de: Hilf anderen Benutzern zu verstehen was dieses Modul macht.

source: If there is a source code repository for this module, enter the URL here.
de: Wenn es ein Repository für dieses Modul existiert, gib hier dessen URL an.

source: Skip this if no repository exists yet. You can update this later in the metadata.json.
de: überspringe die Frage, wenn das Repository noch nicht existiert. Der Wert kann später noch in der metadata.json Datei geändert werden.

source: If there is a URL where others can learn more about this module, enter it here.
de: Gibt es eine URL wo kann man mehr über dieses Modul erfahren kann? Gib sie hier an.

source: Optional. You can update this later in the metadata.json.
de: Optional. Der Wert kann später noch in der metadata.json Datei geändert werden.

source: If there is a public issue tracker for this module, enter its URL here.
de: Wenn ein öffentliches Ticketsystem für dieses Modul existiert, gib seine URL hier an.

source: We need to update the metadata.json file for this module, so we\'re going to ask you %{count} questions.
de: Die metadata.json Datei für dieses Modul muss aktualisiert werden. Dafür fragen wir Dich jetzt %{count} Fragen.

source: We need to create the metadata.json file for this module, so we\'re going to ask you %{count} questions.
de: Die metadata.json Datei für dieses Modul muss erzeugt werden. Dafür fragen wir Dich jetzt %{count} Fragen.

source: If the question is not applicable to this module, accept the default option shown after each question. You can modify any answers at any time by manually updating the metadata.json file.
de: Sollte eine der Fragen nicht relevant sein, kann der Standardwert verwendet werden indem eine leere Antwort gegeben wird. Die Antworten können jederzeit in der metadata.json Datei geändert werden.

source: No answers given, interview cancelled.
de: Keine Daten eingegeben, Modul wird nicht erzeugt.

source: Interview cancelled; exiting.
de: Dateneingabe abgebrochen, Modul wird nicht erzeugt.

source: Process cancelled; exiting.
de: Prozess abgebrochen, Modul wird nicht erzeugt.

source: Unable to generate %{object_type}; '%{file}' already exists.
de: %{object_type} kann nicht erzeugt werden. '%{file}' existiert bereits.

source: Creating '%{file}' from template.
de: '%{file}' wird geschrieben.

source: Unable to create directory '%{path}': %{message}
de: Das Verzeichnis '%{dir}' kann nicht erstellt werden: %{message}

source: Unable to write to file '%{path}': %{message}
de: '%{file}' kann nicht geschrieben werden: %{message}

source: No %{dir_type} template found; trying next template directory.
de: Kein %{dir_type} Template angegeben; versuche nächstes Templateverzeichnis.

source: Unable to find a %{type} template in %{url}; trying next template directory.
de: %{type} nicht in Template %{url} gefunden; versuche nächstes Templateverzeichnis.

source: Unable to find the %{type} template in %{url}.
de: %{type} nicht in Template %{url} gefunden.

source: '%{dir}' does not contain valid Puppet module metadata: %{msg}
de: '%{dir}' entht keine gültigen Puppet Modul Metadaten: %{msg}

source: '%{file}' does not exist or is not a file.
de: '%{file}' existiert nicht, oder ist keine Datei.

source: Unable to open '%{file}' for reading.
de: '%{file}' kann nicht gelesen werden

source: Invalid JSON in metadata.json: %{msg}
de: metadata.json ist nicht gültiges JSON: %{msg}

source: Invalid 'name' field in metadata.json: %{err}
de: metadata.json hat kein gültiges 'name' Feld: %{msg}

source: Rendering '%{template}'...
de: Verarbeite '%{template}'...

source: Failed to render template '%{template}' %{exception}: %{message}
de: Template '%{template}' konnte nicht verarbeitet werden %{exception}: %{message}

source: The specified template '%{path}' is not a directory.
de: Das angegebene Template'%{path}' ist kein Verzeichnis.

source: The template at '%{path}' does not contain a 'moduleroot/' directory.
de: Das Template '%{path}' enthält kein 'moduleroot/' Verzeichnis.

source: The template at '%{path}' does not contain a 'moduleroot_init/' directory, which indicates you are using an older style of template. Before continuing please use the --template-url flag when running the pdk new commands to pass a new style template.
de: Das Template '%{path}' enthält kein 'moduleroot/' Verzeichnis, was ein Indiz dafür ist, dass das Template einem älteren Muster folgt. Bitte verwende die --template-url Option für `pdk new` um ein Template im neuen Muster zu verwenden.

source: The directory '%{dir}' doesn't exist
de: Das Zielverzeichnis '%{dir}' existiert nicht

source: '%{file}' is not a valid YAML file: %{problem} %{context} at line %{line} column %{column}
de: '%{file}' ist keine gültige YAML Datei: %{problem} %{context} in Zeile %{line} Spalte %{column}

source: Unable to clone git repository at '%{repo}' into '%{dest}'.
de: Das git Repository '%{repo}' konnte nicht nach '%{dest}' geklont werden.

source: Unable to checkout '%{ref}' of git repository at '%{path}'.
de: Die '%{ref}' Referenz konnte im git Repository in '%{path}' ausgecheckt werden.

source: unlinking '%{path}'
de: entferne '%{path}'

source: '%{path}': already gone
de: '%{path}': bereits entfernt

source: Unable to remove '%{path}': %{message}
de: '%{file}' kann nicht geschrieben werden: %{message}

source: Unable to open '%{path}' for reading
de: '%{file}' kann nicht gelesen werden

source: writing '%{path}'
de: schreibe '%{path}'

source: You do not have permission to write to '%{path}'
de: Keine Berechtigung in '%{path}' zu schreiben

source: File not specified.
de: `file` nicht angegeben.

source: File must be a String.
de: `file` muss ein String sein.

source: State not specified.
de: `state` nicht angegeben.

source: State must be a Symbol, not %{type}
de: `state` muss ein Symbol, nicht '%{type}' sein.

source: Invalid state %{state}. Valid states are: %{valid}.
de: Ungültiger Zustand '%{state}', erlaubte Zustände sind: %{valid}

source: Source not specified.
de: `source` nicht angegeben.

source: Line must be an Integer or a String representation of an Integer.
de: `line` muss eine Ganzzahl, oder eine Stringdarstellung einer Ganzzahl sein.

source: The line number can contain only the digits 0-9.
de: `line` darf nur die Ziffern von 0-9 enhalten.

source: Column must be an Integer or a String representation of an Integer.
de: `column` muss ein Ganzzahl, oder eine Stringdarstellung einer Ganzzahl sein

source: The column number can contain only the digits 0-9.
de: `column` darf nur die Ziffern von 0-9 enhalten.

source: Trace must be an Array of stack trace lines.
de: `trace` muss ein Array von stack trace Zeilen sein.

source: '%{template}' is not a readable file
de: '%{template}' ist keine lesbare Datei

source: Cleaning up after running unit tests.
de: Räume nach Unit-Testausführung aus.

source: The spec_clean rake task failed with the following error(s):
de: Der rake task `spec_clean` ist mit folgender Fehlermeldung fehlgeschlagen:

source: Running unit tests in parallel.
de: Führe Unit-Tests auf mehreren Threads aus.

source: Running unit tests.
de: Führe Unit-Tests aus.

source: Unit test output did not contain a valid JSON result: %{output}
de: Die Unittest Ausgabe enthielt kein gültiges JSON Ergebnis: %{output}

source: Evaluated %{total} tests in %{duration} seconds: %{failures} failures, %{pending} pending.
de: %{total} Tests in %{duration} Sekunden: %{failures} Fehler, %{pending} ausstehend.

source: Finding unit tests.
de: Unit-Tests werden gesucht.

source: Failed to find valid JSON in output from rspec: %{output}
de: Kein gültiges JSON in rspec Ausgabe gefunden: %{output}

source: Unable to enumerate examples. rspec reported: %{message}
de: Template '%{template}' konnte nicht verarbeitet werden %{exception}: %{message}

source: Cannot resolve a full path to '%{path}', as it does not currently exist.
de: Kann vollständigen Pfad zu '%{path}' nicht berechnen, das es momentan nicht existiert.

source: Package basedir requested for non-package install.
de: Paketinstallationsverzeichnis verlangt, obwohl der PDK nicht als Paket installiert ist.

source: No Gemfile found in '%{cwd}'. Skipping bundler management.
de: Kein Gemfile in '%{cwd}', überspringe bundler Verwaltung.

source: Checking for missing Gemfile dependencies.
de: Gemfile Abhängigkeiten werden überprüft.

source: Using vendored Gemfile.lock from %{source}.
de: Kein Gemfile.lock gefunden, verwende mitgeliefertes Gemfile.lock von '%{source}'.

source: Resolving default Gemfile dependencies.
de: Gemfile Abhängigkeiten werden aufgelöst.

source: Unable to resolve default Gemfile dependencies.
de: Standard-Gemfile Abhängigkeiten konnten nicht aufgelöst werden.

source: Updating Gemfile dependencies.
de: Gemfile Abhängigkeiten werden aufgelöst.

source: Unable to resolve Gemfile dependencies.
de: Gemfile Abhängigkeiten konnten nicht aufgelöst werden.

source: Installing missing Gemfile dependencies.
de: Fehlende Gemfile Abhängigkeiten werden installiert.

source: Unable to install missing Gemfile dependencies.
de: Fehlende Gemfile Abhängigkeiten konnten nicht installiert werden.

source: Failed to generate binstubs for '%{gems}': %{output}
de: Konnte binstubs für %{gems} nicht erzeugen: %{output}

source: Unable to install requested binstubs.
de: Verlangte binstubs konnten nicht installiert werden.

source: Git command failed: git %{args}
de: Git Befehl fehlgeschlagen: git %{args}

source: Unable to locate git work dir "%{workdir}"
de: Das git-Arbeitsverzeichnis "%{workdir}" konnte nicht gefunden werden.

source: Unable to locate git dir "%{gitdir}"
de: Das git-Verzeichnis "%{gitdir}" konnte nicht gefunden werden.

source: Unable to access the template repository "%{repository}"
de: Das Template git Repository "%{repository}" ist nicht zugänglich.

source: Unable to clone git repository from '%{repo}'.
de: Das git Repository '%{repo}' konnte nicht geklont werden.

source: Unable to fetch from git remote at '%{repo}'.
de: Das git Repository '%{repo}' konnte nicht heruntergeladen werden.

source: Unable to update git repository at '%{cachedir}'.
de: Das git Repository '%{cachedir}' konnte nicht aktualisiert werden.

source: Unable to find a Puppet gem matching %{requirement}.
de: Es wurde kein Puppet gem gefunden, das den Anforderungen (%{requirement}) entspricht.

source: %{version} is not a valid version number.
de: %{version} ist keine gültige Version.

source: Unable to find a valid module template to use.
de: Eswurde kein gültiges Modultemplate gefunden.

source: Unable to find a valid template at %{uri}
de: Es wurde kein gültiges Template in %{uri} gefunden

source: Unable to download %{url}. %{code}: %{message}.
de: '%{file}' kann nicht geschrieben werden: %{message}

source: Unable to download %{url}. Check internet connectivity and try again. %{error}
de: Konnte nicht von %{url} herunterladen. Bitte überprüfe Deine Internetverbindung und versuche es nochmals: %{error}

source: Invoking %{cmd}
de: Führe '%{cmd} aus

source: Checking module metadata style (%{targets}).
de: Überprüfe metadata Stil (%{targets}).

source: Checking metadata syntax (%{targets}).
de: Überprüfe metadata Syntax (%{targets}).

source: Could not be read.
de: Konnte nicht gelesen werden.

source: Checking Puppet manifest style (%{pattern}).
de: Überprüfe Puppet Manifest Stil (%{pattern}).

source: Checking Puppet manifest syntax (%{pattern}).
de: Überprüfe Puppet Manifest Syntax (%{pattern}).

source: Checking Ruby code style (%{pattern}).
de: Überprüfe Ruby Code Stil (%{pattern}).

source: Checking task metadata style (%{targets}).
de: Überprüfe metadata Stil (%{targets}).

source: Invalid task name. Task names must start with a lowercase letter and can only contain lowercase letters, numbers, and underscores.
de: Ungültiger Taskname. Tasknamen müssen mit einem Kleinbuchstaben anfangen und dürfen nur Kleinbuchstaben, Ziffern und Unterstriche enthalten.

source: Checking task names (%{targets}).
de: Überprüfe task names (%{targets}).

source: Checking YAML syntax (%{targets}).
de: Überprüfe YAML Syntax (%{targets}).
