Repository: DavidS/pdk
Catalog: locales/*/pdk.po
Languages: de

source: Unknown analytics key '%{key}'
de: Unbekannter Schlüssel '%{key}' für Datenauswertung

source: Answer file can be updated only with a Hash
de: Antwortdatei kann nur mit einem Hash aktualisiert werden

source: Unable to open '%{file}' for reading
de: '%{file}' kann nicht gelesen werden

source: Answer file '%{path}' did not contain a valid set of answers, recreating it
de: Die answer.json Datei '%{path}' enthielt keinen gültigen Datensatz. Es wird überschrieben.

source: Answer file '%{path}' did not contain valid JSON, recreating it
de: Die answer.json Datei '%{path}' enthielt ungültiges JSON. Es wird überschrieben.

source: Unable to write '%{file}': %{msg}
de: '%{file}' kann nicht geschrieben werden: %{msg}

source: Specifies the URL to the template to use when creating new modules or classes. (default: %{default_url})
de: Die URL zum Template das für die neue Module und Klassen genutzt werden soll. (Standard: %{default_url})

source: Specifies the template git branch or tag to use when creating new modules or classes.
de: Der Zweig oder Tag im Template Repository das für die neue Module und Klassen genutzt werden soll.

source: When specified, skips interactive querying of metadata.
de: Überspringe interaktive Abfrage von Metadaten.

source: When specified, interactive querying of metadata will include all optional questions.
de: Aktiviere alle optional Fragen in der interaktiven Abfrage von Metadaten.

source: Puppet version to run tests or validations against.
de: Welche Version von Puppet soll für Tests und Validierung verwendet werden.

source: Puppet Enterprise version to run tests or validations against.
de: Welche Version von Puppet Enterprise soll für Tests und Validierung verwendet werden.

source: When specified, PDK will validate or test against the current Puppet source from github.com. To use this option, you must have network access to https://github.com.
de: Mit dieser Option wird gegen den aktuellen Quellcode von Puppet von github.com getested und validiert. Um diese Option nutzen zu können, muss https://github.com erreichbar sein.

source: pdk command [options]
de: pdk befehl [optionen]

source: The shortest path to better modules.
de: Der kürzeste Weg zu besseren Modulen.

source: Show version of pdk.
de: Version des pdk anzeigen.

source: Show help for this command.
de: Hilfetext für diesen Befehl anzeigen.

source: Specify desired output format. Valid formats are '%{available_formats}'. You may also specify a file to which the formatted output is sent, for example: '--format=junit:report.xml'. This option may be specified multiple times if each option specifies a distinct target file.
de: Das gewünschte Ausgabeformat. Gültige Werte sind '%{available_formats}'. Zusätzlich kann hier ein Dateiname angegeben werden um die formatierte Ausgabe zu speichern. Zum Beispiel: '--format=junit:report.xml'. Solange jeder Wert ein eigene Ausgabedatei angibt kann diese Option mehrmals angeführt werden.

source: Enable debug output.
de: Debug Ausgabe aktivieren.

source: Path to an answer file.
de: Pfad zur Antwortdatei.

source: build [options]
de: build [optionen]

source: Builds a package from the module that can be published to the Puppet Forge.
de: Packt das Module in ein Archiv, das auf der Puppet Forge veröffentlicht werden kann.

source: The target directory where you want PDK to write the package.
de: Das Zielverzeichnis in dem PDK das Paket erzeugen soll.

source: Skips the prompts and builds the module package.
de: Überspringt alle Abfragen und baut das Modulepaket.

source: `pdk build` can only be run from inside a valid module with a metadata.json.
de: `pdk build` muss innerhalb eines Modules aufgerufen werden (kein metadata.json gefunden)

source: This module is missing the following fields in the metadata.json: %{fields}. These missing fields may affect the visibility of the module on the Forge.
de: Diesem Module fehlen die folgenden Felder in metadata.json: %{fields}. Die fehlenden Felder können die Sichtbarkeit des Moduls auf der PuppetForge beeinträchtigen.

source: The file '%{package}' already exists.
de: Die Datei '%{package}' existiert bereits

source: Overwrite?
de: Überschreiben?

source: Build cancelled; exiting.
de: Paketierung abgebrochen.

source: This module is not compatible with PDK, so PDK can not validate or test this build. Unvalidated modules may have errors when uploading to the Forge. To make this module PDK compatible and use validate features, cancel the build and run `pdk convert`.
de: Dieses Modul ist nicht PDK-kompatibel. Ohne diese Kompatibilität kann PDK das Module nicht testen und validieren. Die Puppet Forge kann fehlerhafte Module ablehnen. Eine Validierung stellt sicher, dass solche Fehler vor der Veröffentlichung gefunden werden. Um dieses Module PDK-kompatibel zu machen, brich bitte die Paketierung ab und führe `pdk convert` aus.

source: Continue build without converting?
de: Paketierung ohne Konvertierung durchführen?

source: Building %{module_name} version %{module_version}
de: %{module_name} version %{module_version} wird paketiert

source: Build of %{package_name} has completed successfully. Built package can be found here: %{package_path}
de: Paketierung von %{package_name} wurde erfolgreich abgeschlossen. Das Paket befindet sich hier: %{package_path}

source: bundle [bundler_options]
de: bundle [bundler_optionen]

source: (Experimental) Command pass-through to bundler
de: (experimentell) Diese Befehl erlaubt beliebige Kommandos mit `bundler` auszuführen

source: [experimental] For advanced users, pdk bundle runs arbitrary commands in the bundler environment that pdk manages. Careless use of this command can lead to errors that pdk can't help recover from.
de: [experimentell] Fortgeschrittene Benutzer können mit diesem Kommando beliebige Befehle in der Bundler Umgebung des PDK ausführen. Unachtsame Verwendung dieses Befehls kann zu Fehlern führen, die der PDK nicht automatisch beheben kann.

source: `pdk bundle` can only be run from inside a valid module directory.
de: `pdk bundle` muss innerhalb eines Modules aufgerufen werden.

source: convert [options]
de: convert [optionen]

source: Convert an existing module to be compatible with the PDK.
de: Modifiziert ein bestehendes Modul um es kompatibel mit dem PDK zu machen.

source: Do not convert the module, just output what would be done.
de: Modifizierungen nicht anwenden. Es wird nur ein Bericht der erforderlichen Änderungen ausgegeben.

source: Convert the module automatically, with no prompts.
de: Das Modul wird ohne weitere Abfragen modifiziert.

source: `pdk convert` can only be run from inside a valid module directory.
de: `pdk convert` muss innerhalb eines Modules aufgerufen werden.

source: You can not specify --noop and --force when converting a module
de: --noop und --force können nicht gleichzeitig verwendet werden.

source: Ignoring --full-interview and continuing with --skip-interview.
de: --full-interview wird wegen --skip-interview ignoriert.

source: Ignoring --full-interview and continuing with --force.
de: --full-interview wird wegen --force ignoriert.

source: An unexpected error has occurred. Try running the command again with --debug
de: Ein unerwarteter Fehler ist aufgetreten. Das gleiche Kommando mit --debug kann mehr Information zur Ursache geben.

source: Unable to find `%{name}`. Check that it is installed and try again.
de: Der Befehl `%{name}` konnte nicht gefunden werden, ist aber für die verlangte Operation notwendig.

source: PDK package installation not found. Trying '%{fallback}' from the system PATH instead.
de: PDK Paketinstallation nicht gefunden, versuche stattdessen '%{fallback}' vom Systempfad (PATH).

source: Could not find '%{vendored_bin}' in PDK package. Trying '%{fallback}' from the system PATH instead.
de: Konnte '%{vendored_bin}' nicht im PDK Paket finden, versuche stattdessen '%{fallback}' vom Systempfad (PATH).

source: Using '%{vendored_bin}' from PDK package.
de: Verwende '%{vendored_bin}' aus dem PDK Paket.

source: Expected execution context to be :system or :module but got '%{context}'.
de: Ausführumgebung '%{context}' nicht erkannt. Sie muss :system oder :module sein.

source: PUPPET_GEM_VERSION is not supported by PDK. Please use the --puppet-version option on your PDK command or set the PDK_PUPPET_VERSION environment variable instead
de: PUPPET_GEM_VERSION wird nicht vom PDK unterstützt. Bitte verwende stattdessen die --puppet-version Option beim Aufruf vom PDK oder die PDK_PUPPET_VERSION Umgebungsvariable.

source: %{varname} is not supported by PDK.
de: %{varname} wird nicht vom PDK unterstützt.

source: Current working directory is not part of a module. (No metadata.json was found.)
de: Das aktuelle Arbeitsverzeichnis ist kein Modul. (Kein 'metadata.json' gefunden.)

source: Executing '%{command}'
de: Befehl '%{command}' wird ausgeführt

source: Command environment:
de: Umgebungsvariable des Befehls:

source: Failed to execute '%{command}': %{message}
de: Konnte Befehl '%{command}' nicht ausführen: %{message}

source: Execution of '%{command}' complete (duration: %{duration_in_seconds}s; exit code: %{exit_code})
de: Befehl '${command}' ausgeführt. (Dauer: %{duration_in_seconds}s; exitcode: %{exit_code})

source: No block registered
de: Kein block registriert

source: module [options]
de: module [optionen]

source: Provide CLI-backwards compatibility to the puppet module tool.
de: Rückwärtskompatibilität mit dem `puppet module` Befehl.

source: This command is only for reminding you how to accomplish tasks with the PDK, when you were previously doing them with the puppet module command.
de: Dieser Befehl existiert nur um den Umstieg von `puppet module` zu erleichtern.

source: This command is now 'pdk build'.
de: Dieser Befehl ist jetzt `pdk build`.

source: Modules are built using the ‘pdk build’ command.
de: Module werden mit dem `pdk build` Befehl paketiert.

source: generate [options] <module_name>
de: generate [optionen] <modulname>

source: This command is now 'pdk new module'.
de: Dieser Befehl ist jetzt `pdk new module`.

source: New modules are created using the ‘pdk new module’ command.
de: Neue Module werden mit dem `pdk new module` Befehl erzeugt.

source: Creating new module: %{modname}
de: Neues Modul: %{modname}

source: new <thing> [options]
de: new <objekt> [optionen]

source: create a new module, etc.
de: erzeuge ein neues Modul, etc.

source: Creates a new <thing> using relevant options.
de: Erzeugt ein neues <objekt> mit den angegebenen Optionen.

source: class [options] <class_name>
de: class [optionen] <klassen_name>

source: Create a new class named <class_name> using given options
de: Erzeugt eine neue Klasse mit dem Namen <klassen_name>, und den angegebenen Optionen

source: Classes can only be created from inside a valid module directory.
de: Klassen können nur innerhalb eines Moduls erzeugt werden.

source: '%{name}' is not a valid class name
de: '%{name}' ist kein gültiger Klassenname

source: defined_type [options] <name>
de: defined_type [optionen] <name>

source: Create a new defined type named <name> using given options
de: Erzeugt einen neuen "defined type" mit dem Namen <name> und den angegebenen Optionen

source: Defined types can only be created from inside a valid module directory.
de: "Defined Types" können nur innerhalb eines Moduls erzeugt werden.

source: '%{name}' is not a valid defined type name
de: '%{name}' ist kein gültiger Name für einen "Defined Type"

source: module [options] [module_name] [target_dir]
de: module [optionen] [modulname] [zielverzeichnis]

source: Create a new module named [module_name] using given options
de: Erzeugt ein neues Modul mit dem Namen [modulename] und den angegebenen Optionen

source: Specifies the license this module is written under. This should be a identifier from https://spdx.org/licenses/. Common values are 'Apache-2.0', 'MIT', or 'proprietary'.
de: Verwende die angegebene Lizenz für dieses Modul. Erlaubte Werte sind 'identifier' von https://spdx.org/licenses/. Übliche Lizenzen sind 'Apache-2.0', 'MIT', oder 'proprietary'.

source: Do not automatically run `bundle install` after creating the module.
de: Überspringe den üblichen `bundle install` Aufruf nachdem das Modul erzeugt wurde.

source: provider [options] <name>
de: provider [optionen] <name>

source: [experimental] Create a new ruby provider named <name> using given options
de: (experimentell) erzeugt einen neuen Ruby Provider mit dem Namen <name> und den angegebenen Optionen.

source: '%{name}' is not a valid provider name
de: '%{name}' ist kein gültiger Providername

source: task [options] <name>
de: task [optionen] <name>

source: Create a new task named <name> using given options
de: Erzeugt einen neuen Task mit dem Namen <name>, und den angegebenen Optionen

source: A short description of the purpose of the task
de: Eine kurze Beschreibung des Tasks

source: Tasks can only be created from inside a valid module directory.
de: Tasks können nur in einem Modul erzeugt werden.

source: '%{name}' is not a valid task name
de: '%{name}' ist kein gültiger Taskname

source: test [subcommand] [options]
de: test [unterbefehl] [optionen]

source: Run tests.
de: Führe Tests aus.

source: unit [options]
de: unit [optionen]

source: Run unit tests.
de: Führe Unit-Tests aus.

source: List all available unit test files.
de: Gibt die Namen aller verfügbaren Unit-Test-Dateien aus.

source: Run unit tests in parallel.
de: Führe Unit-Tests auf mehreren Threads aus.

source: More verbose --list output. Displays a list of examples in each unit test file.
de: Detaillierte --list Ausgabe. Gibt auch eine liste aller Testbeispiele in den Unit-Test-Dateien aus.

source: Clean up downloaded fixtures after the test run.
de: Heruntergeladene Testfixtures nach der Testausführung aufräumen.

source: Specify a comma-separated list of unit test files to run.
de: eine Komma-getrennte Liste aller Tests, die ausgeführt werden sollen

source: Unit tests can only be run from inside a valid module directory.
de: Unit-Tests können nur in einem Modul ausgeführt werden.

source: No unit test files with examples were found.
de: Es wurden keine Unit-Test-Dateien mit Testbeispielen gefunden.

source: Unit Test Files:
de: Unit-Test-Dateien:

source: --verbose has no effect when not used with --list
de: --verbose wird wegen --list ignoriert.

source: update [options]
de: update [optionen]

source: Update a module that has been created by or converted for use by PDK.
de: Ein PDK-kompatibles Modul aktualisieren.

source: Do not update the module, just output what would be done.
de: Aktuali

source: Update the module automatically, with no prompts.
de: Aktualisierungen nicht anwenden. Es wird nur ein Bericht der erforderlichen Änderungen ausgegeben.

source: `pdk update` can only be run from inside a valid module directory.
de: `pdk update` kann nur in einem Modul ausgeführt werden.

source: This module does not appear to be PDK compatible. To make the module compatible with PDK, run `pdk convert`.
de: Dieses Modul scheint nicht PDK-kompatibel zu sein. Führe `pdk convert` aus um die notwendigen Änderungen durchzuführen.

source: You can not specify --noop and --force when updating a module
de: --noop und --force können nicht gleichzeitig verwendet werden.

source: This command must be run from inside a valid module (no metadata.json found).
de: Dieses Kommando muss innerhalb eines Modules aufgerufen werden (kein metadata.json gefunden).

source: Answer "Y" to continue or "n" to cancel.
de: Antworte mit "Y" um weiterzumachen, oder "n" um abzubrechen.

source: This module is not PDK compatible. Run `pdk convert` to make it compatible with your version of PDK.
de: Dieses Modul scheint nicht PDK-kompatibel zu sein. Führe `pdk convert` aus um die notwendigen Änderungen durchzuführen, damit es kompatibel mit PDK wird.

source: This module template is out of date. Run `pdk convert` to make it compatible with your version of PDK.
de: Dieses Modul wurde mit einer alten Version der Templates erstellt. Führe `pdk convert` aus um die notwendigen Änderungen durchzuführen, damit es wieder kompatibel mit PDK ist.

source: This module is compatible with a newer version of PDK. Upgrade your version of PDK to ensure compatibility.
de: Dieses Modul ist kompatibel mit einer neueren Version des PDK. Aktualisiere deine PDK Version um sicherzustellen, dass alles funktioniert.

source: This module is compatible with an older version of PDK. Run `pdk update` to update it to your version of PDK.
de: Dieses Modul ist kompatibel mit einer älteren Version des PDK. Führe `pdk convert` aus um die notwendigen Änderungen durchzuführen, damit es wieder kompatibel mit PDK ist.

source: Using Ruby %{version}
de: Verwende Ruby %{version}

source: Using %{gem} %{version}
de: Verwende %{gem} %{version}

source: You cannot specify a %{first} and %{second} at the same time.
de: %{first} und %{second} können nicht gleichzeitig verwendet werden.

source: --template-ref requires --template-url to also be specified.
de: --template-ref erfordert auch einen Wert für --template-url.

source: --template-url may not be used to specify paths containing #'s.
de: --template-url kann nicht verwendet werden um Pfade anzugeben, die ein #-Zeichen enthalten.

source: Did you mean '%{command}'?
de: Meinst Du '%{command}'?

source: [Q %{current_number}/%{questions_total}]
de: [Frage %{current_number}/%{questions_total}]

source: Error: expected comma separated list
de: Fehler: Komma-getrennte Liste erwartet

source: '%{name}' is not a valid report format (%{valid})
de: '%{name}' ist kein gültiges Format (%{valid})

source: Error: the following values are invalid: %{invalid_entries}
de: Fehler: die folgenden Einträge sind ungültig: %{invalid_entries}

source: validate [validators] [options] [targets]
de: validate [prüfer] [optionen] [ziele]

source: Run static analysis tests.
de: Statische Analysen ausführen.

source: Run metadata, YAML, Puppet, Ruby, or Tasks validation. [validators] is an optional comma-separated list of validators to use. If not specified, all validators are used. Note that when using PowerShell, the list of validators must be enclosed in single quotes. [targets] is an optional space-separated list of files or directories to be validated. If not specified, validators are run against all applicable files in the module.
de: Führt metadata, YAML, puppet, oder ruby Validierung durch. [prüfer] ist eine optionale Liste von Prüfern. Mehrere Prüfer können mit Komma getrennt werden. Wird kein Prüfer ausgewählt, werden alle verwendet. Beachte bitte, dass in einer PowerShell die Liste mit einfachen Anführungszeichen geschützt werden muss. [ziele] ist eine optionale Liste von Dateien und Verzeichnissen, die geprüft werden sollen. Mehrere Dateien und Verzeichnisse können mit Leerzeichen getrennt angegeben werden. Werden keine Ziele ausgewählt, werden alle Dateien im Modul geprüft.

source: List all available validators.
de: Gibt die Namen aller verfügbaren Prüfer aus.

source: Automatically correct problems where possible.
de: Korrigiere Probleme automatisch wenn möglich.

source: Run validations in parallel.
de: Führe Prüfungen auf mehreren Threads aus.

source: Available validators: %{validator_names}
de: Verfügbare Prüfer: %{validator_names}

source: Code validation can only be run from inside a valid module directory
de: Quellkodevalidierungen können nur in einem Modul ausgeführt werden.

source: Unknown validator '%{v}'. Available validators: %{validators}.
de: Prüfer '%{v}' nicht erkannt. Verfügbare Prüfer: %{validators}

source: Running all available validators...
de: Führe alle verfügbaren Prüfer aus...

source: Validating module using %{num_of_threads} threads
de: Validiere Modul mit %{num_of_threads} threads

source: PDK collects anonymous usage information to help us understand how it is being used and make decisions on how to improve it. You can find out more about what data we collect and how it is used in the PDK documentation at %{url}.
de: Der PDK sammelt anonyme Verwendungsdaten damit wir verstehen können wie der PDK verwendet wird und bessere Entscheidungen zu seiner Verbesserung zu treffen. Du kannst mehr über die Daten die wir sammeln und wie wir sie verwenden auf %{url} nachlesen.

source: You can opt in or out of the usage data collection at any time by editing the analytics configuration file at %{path} and changing the '%{key}' value.
de: Die Zustimmung zur anonymen Nutzungsdatensammlung kann jederzeit durch das Bearbeiten des '%{key}' Werts in der Konfigurationsdatei %{path} geändert werden.

source: Do you consent to the collection of anonymous PDK usage information?
de: Stimmst Du der Sammlung anonymer PDK Nutzungsdaten zu?

source: No answer given, opting out of analytics collection.
de: Nutzdatensammlung deaktiviert.

source: Only PDK::Config::Namespace objects can be mounted into a namespace
de: Nur PDK::Config::Namespace Objekte können in einen Namespace gemounted werden.

source: Unable to open %{file} for reading
de: '%{file}' kann nicht gelesen werden

source: Unable to open %{file} for writing
de: '%{file}' kann nicht geschrieben werden

source: must be a boolean: true or false
de: muss ein Wahrheitswert sein: true oder false.

source: must be a version 4 UUID
de: muss ein UUID Version 4 Wert sein.

source: `validator` must be a Hash
de: `validator` muss ein Hash sein.

source: the :proc key must contain a Proc
de: Der :proc Schlüssel muss eine Proc enhalten

source: the :message key must contain a String
de: der :message Schlüssel muss einen String enthalten

source: must be passed a block
de: muss einen Block empfangen

source: Syntax error when loading %{file}: %{error}
de: Syntaxfehler in der %{file} Datei: %{error}

source: Unsupported class in %{file}: %{error}
de: Nicht unterstützte Klasse in der %{file} Datei gefunden: %{error}

source: '%{module_name}' is not a valid module name. Module names must begin with a lowercase letter and can only include lowercase letters, digits, and underscores.
de: '%{module_name}' ist kein gülter Modulname. Modulname müssen mit einem Kleinbuchstaben anfangen und dürfen nur Kleinbuchstaben, Ziffern und Unterstriche enthalten.

source: The destination directory '%{dir}' already exists
de: Das Zielverzeichnis '%{dir}' existiert bereits

source: You do not have permission to write to '%{parent_dir}'
de: Keine Berechtigung in '%{parent_dir}' zu schreiben

source: Module '%{name}' generated at path '%{path}', from template '%{url}'.
de: Modul '%{name}' wurde in '%{path}' erzeugt. Template: '%{url}'.

source: In your module directory, add classes with the 'pdk new class' command.
de: Im neuen Modulverzeichnis, füge Klassen mit dem `pdk new class` Befehl hinzu.

source: Failed to move '%{source}' to '%{target}': %{message}
de: Konnte '%{source}' nicht nach '%{target}' verschieben: %{message}

source: Your username is not a valid Forge username. Proceeding with the username %{username}. You can fix this later in metadata.json.
de: Der Benutzername entspricht nicht den Einschränkungen der Puppet Forge. Verwende stattdessen '%{username}'. Das kann nachträglich in metadata.json korrigiert werden.

source: Unable to create directory '%{dir}': %{message}
de: Das Verzeichnis '%{dir}' kann nicht erstellt werden: %{message}

source: If you have a name for your module, add it here.
de: Der Name deines Moduls

source: This is the name that will be associated with your module, it should be relevant to the modules content.
de: Dies ist der Name der dein Modul bezeichnet. Er sollte relevant für den Inhalt des Moduls sein.

source: Module names must begin with a lowercase letter and can only include lowercase letters, numbers, and underscores.
de: Modulname müssen mit einem Kleinbuchstaben anfangen und dürfen nur Kleinbuchstaben, Ziffern und Unterstriche enthalten.
